In [1]:
import pandas as pd

In [2]:
application_train = pd.read_csv('application_train.csv')
application_train = application_train.iloc[:, :2]
print(application_train.shape)
application_train.head()

(307511, 2)

   SK_ID_CURR  TARGET
0      100002       1
1      100003       0
2      100004       0
3      100006       0
4      100007       0

In [3]:
bureau = pd.read_csv('bureau.csv')
bureau = bureau.iloc[:, :2]
print(bureau.shape)
bureau.head()

(1716428, 2)

   SK_ID_CURR  SK_ID_BUREAU
0      215354       5714462
1      215354       5714463
2      215354       5714464
3      215354       5714465
4      215354       5714466

In [4]:
previous_loan_counts = bureau.groupby('SK_ID_CURR', as_index=False)['SK_ID_BUREAU'].count()
previous_loan_counts = previous_loan_counts.rename(columns={'SK_ID_BUREAU': 'previous_loan_counts'})
previous_loan_counts.head()

   SK_ID_CURR  previous_loan_counts
0      100001                     7
1      100002                     8
2      100003                     4
3      100004                     2
4      100005                     3

In [5]:
application_train = pd.merge(application_train, previous_loan_counts, on='SK_ID_CURR', how='left')

In [6]:
application_train['previous_loan_counts'].fillna(0, inplace=True)
application_train.head()

   SK_ID_CURR  TARGET  previous_loan_counts
0      100002       1                   8.0
1      100003       0                   4.0
2      100004       0                   2.0
3      100006       0                   0.0
4      100007       0                   1.0